"CIAdditionCompositing" = "Lägger till färgkomponenter för att uppnå en ljusare effekt. Filtret används ofta för att lägga till högdagrar och ljusreflexer.";"CIAffineClamp" = "Utför en affin transformering av en källbild, fäster bildpunkterna i kanten på den transformerade bilden och sträcker ut dem. Filtret liknar CIAffine Transform, med den skillnaden att det skapar en bild med obegränsad utsträckning. Det kan användas då du vill göra en bild oskarp men vill undvika att få en svart, fransig kant runt bilden.";"CIAffineTile" = "Utför en en affin transformering av en bild och lägger sedan den transformerade bilden i ett rutmönster.";"CIAffineTransform" = "Utför en affin tranformering av en bild. Bilden kan skalas, omformas eller roteras. Det går också att kombinera dessa åtgärder.";"CIBarsSwipeTransition" = "En bild övergår i en annan genom att rektangulära delar av förgrundsbilden glider undan så att målbilden syns.";"CIBlendWithMask" = "Använder värden från en gråskalemask för att interpolera mellan en bild och bakgrunden. Då maskvärdet är 0,0 är bakgrunden resultatet. Då maskvärdet är 1,0 är bilden resultatet.";"CIBloom" = "Gör kanter mjukare och ger bilden ett behagligt ljus.";"CIBoxBlur" = "Gör en bild mjukare eller skarpare med hjälp av en fyrkantig sammansättningskärna.";"CIBumpDistortion" = "Skapar en konkav eller konvex in-/utbuktning som utgår ifrån en angiven punkt i bilden.";"CIBumpDistortionLinear" = "Skapar en utbuktning som utgår från en linjär del av bilden.";"CICMYKHalftone" = "Skapar en färgbild i halvton från källbilden med cyan, magenta, gult och svart färg på en vit sida.";"CICheckerboardGenerator" = "Skapar ett shackmönster. Det går att ange mönstrets storlek, skärpa och färger.";"CICircleSplashDistortion" = "Förvränger bildpunkterna med början vid cirkelns omkrets och utåt.";"CICircularScreen" = "Simulerar ett cirkelformat halvtonsraster.";"CICircularWrap" = "Sveper en bild runt en genomskinlig cirkel. Bildens förvrängning ökar med avståndet från cirkelns mitt. ";"CIColorControls" = "Justerar nyans-, ljusstyrke- och kontrastvärden.";"CIColorCube" = "Använder en tredimensionell färgtabell som omvandlar bildpunkterna i källbilden. Färgtabellen måste bestå av RGBA-flyttalsceller med förmångfaldigat alfa. Cellerna är i standardordning. Kolumnerna och raderna indexeras efter rött respektive grönt. Varje dataplan följs av nästa högre plan. Planen indexeras efter blått.";"CIColorInvert" = "Inverterar färgerna i en bild.";"CIColorMap" = "Utför en icke-linjär transformering av källfärgvärdena genom att använda kopplingsvärden från en tabell.";"CIColorMatrix" = "Multiplicerar källfärgsvärden och lägger till en förskjutningsfaktor till varje färgkomponent.";"CIColorMonochrome" = "Ordnar om färger så att de ligger ton i ton med en enda färg.";"CIColorPosterize" = "Ordnar om de röda, gröna och blåa färgkomponenterna enligt antalet ljusstyrkevärden som angetts för varje färgkomponent. Filtret tonar ner färgerna och ger bilden ett utseende som i screentryck.";"CIComicEffect" = "Simulerar en serieteckning genom att fylla i kanter och ge färgen en halvtonseffekt.";"CIConstantColorGenerator" = "Skapar en obruten färg. Filtrets utdata brukar användas som indata till ett annat filter.";"CICopyMachineTransition" = "En bild övergår i en annan genom att simulera en kopiator.";"CICrop" = "Beskär bilden. Storleken och formen på den beskurna bilden beror på rektangeln du anger.";"CICrystallize" = "Skapar polygonformade färgblock genom slå samman källbildpunkternas färgvärden.";"CIDiscBlur" = "Gör en bild mjukare eller skarpare med hjälp av en rund sammansättningskärna.";"CIDisintegrateWithMaskTransition" = "Övergår från en bild till en annan genom en form som anges av en mask.";"CIDisplacementDistortion" = "Använder den andra bildens gråskalevärden på den första. Målbildens textur bestäms av gråskalevärdena.";"CIDissolveTransition" = "Övergång från en bild till en annan genom upplösning.";"CIDotScreen" = "Simulerar punktmönstret i ett halvtonsraster.";"CIEdges" = "Hittar alla kanter i en bild och visar dem i färg.";"CIEdgeWork" = "Skapar en stiliserad svartvit version av en bild. Detta liknar ett träsnitt.";"CIEightfoldReflectedTile" = "Skapar en rutmönster från en källbild genom 8-faldigt reflekterad symmetri.";"CIExposureAdjust" = "Justerar exponeringsinställningarna för en bild. Det fungerar på samma sätt som när man bestämmer exponeringtiden genom att justera bländarstegen på en kamera.";"CIFalseColor" = "Kopplar ljusstyrka till en färgramp med två färger. Falsk färg används ofta för att bearbeta vetenskapliga data, till exempel ultravioletta bilder och röntgenbilder.";"CIFastBoxBlur" = "Gör en bild mjukare eller skarpare med hjälp av en fyrkantig sammansättningskärna.";"CIFastDiscBlur" = "Gör en bild mjukare eller skarpare med hjälp av en rund sammansättningskärna.";"CIFlashTransition" = "Övergång från en bild till en annan genom en blixt. Du bestämmer blixtens utgångspunkt. Blixten är till en början liten men växer snabbt tills hela bilden är fylld av blixtfärgen. När färgen tonar bort blir målbilden synlig.";"CIFourfoldReflectedTile" = "Skapar en rutmönster från en källbild genom fyrfaldigt reflekterad symmetri.";"CIFourfoldRotatedTile" = "Framställer en rutmönstrad bild från källbilden genom att rotera källan i steg om 90 grader.";"CIFourfoldTranslatedTile" = "Skapar en rutmönster från en källbild genom fyra omvandlingar.";"CIGammaAdjust" = "Justerar mellantonernas ljusstyrka. Filtret används ofta för att kompensera för icke-linjära skärmeffekter. När gammavärdet justeras förändras lutningen i övergången mellan svart och vitt.";"CIGaussianBlur" = "Sprider källans bildpunkter med den mängd som anges av en gaussisk fördelning.";"CIGaussianGradient" = "Skapar en övertoning som varierar från en färg till en annan med hjälp av gaussisk fördelning.";"CIGlassDistortion" = "Förvränger en bild genom att lägga på en glasliknande textur. Målbildens upphöjda delar skapas av en pålagd texturkarta.";"CIGlassLozenge" = "Skapar en tablettformad lins och förvränger bilden där linsen placeras.";"CIGlideReflectedTile" = "Skapar en bild med rutmönster från en källbild genom att omvandla och smeta ut bilden.";"CIGloom" = "Dämpar högdagrar i en bild.";"CIHatchedScreen" = "Simulerar ett halvtonsrasters skrafferade mönster.";"CIHeightFieldFromMask" = "Skapar ett kontinuerligt tredimensionellt loftformat höjdfält från en gråskalemask. Maskens vita värden bestämmer bildpunkterna inuti höjdfältet och de svarta värdena bestämmer bildpunkterna utanför. Fältet varieras ständigt och smidigt och når värdet 0 vid maskens kant. Det här filtret kan användas tillsammans med filtret CIShadedMaterial för att skapa extremt realistiskt skuggade objekt.";"CIHexagonalPixellate" = "Visar en bild som färgade sexhörningar vars färg blir genomsnittet av bildpunkterna de ersätter.";"CIHoleDistortion" = "Skapar ett cirkelformat område som trycker bildens bildpunkter utåt. Pixlarna närmast cirkeln förvrängs mest.";"CIHueAdjust" = "Ändrar källbildpunkternas nyans.";"CIKaleidoscope" = "Skapar en kalejdoskopisk bild från en källbild genom tolvfaldigt reflekterad symmetri.";"CILanczosScaleTransform" = "Skapar en förstorad eller förminskad bildversion av hög kvalitet. Filtret brukar oftast användas till att förminska en bild.";"CILenticularHaloGenerator" = "Simulerar en nimbus som skapas genom den diffraktion som är förknippad med en lins brännvidd. Filtret används ofta på en annan bild för att skapa ljusreflexer eller liknande effekter.";"CILineOverlay" = "Skapar en skiss över bildens kanter i svart och lämnar bildens övriga delar genomskinliga. Resultatet har alfa och renderas i svart och kommer inte till sin rätt tills den renderas över en annan bild genom sammansättning med källan.";"CILineScreen" = "Simulerar ett halvtonsrasters linjemönster.";"CILinearGradient" = "Skapar en övertoning som varierar längst en linjär axel mellan två bestämda punkter.";"CIMaskToAlpha" = "Konverterar en gråskalebild till en alfamaskerad vit bild. Vitvärdena från källbilden skapar maskens insida. De svarta värdena blir genomskinliga.";"CIMaximumCompositing" = "Räknar ut varje färgkomponents maxvärde från två källbilder och skapar en målbild med maxvärdena. Detta liknar pjattning.";"CIMedianFilter" = "Räknar ut medianvärdet för en grupp närliggande bildpunkter och byter ut varje enskild bildpunkts värde mot medianvärdet. Effekten blir att bildens brus reduceras.";"CIMinimumCompositing" = "Räknar ut varje färgkomponents minsta värde utifrån två indatabilder och skapar en utdatabild med värdena. Detta liknar efterexponering.";"CIModTransition" = "Övergår från en bild till en annan genom att visa målbilden genom oregelbundet formade hål.";"CIMotionBlur" = "Skapar oskärpa i en bild genom att simulera en kamera som rör sig i en angiven vinkel från ett angivet avstånd när bilden tas.";"CIMultiplyCompositing" = "Muliplicerar två källbilders färgkomponenter och skapar en målbild med de multiplicerade värdena. Filtret används normalt för att lägga till en spotlight eller liknande ljuseffekt till bilden.";"CINoiseReduction" = "Minskar brus utifrån ett tröskelvärde som anger vad som anses vara brus. Små ändringar i ljusstyrkan under det värdet räknas som brus och påverkas av brusreduceringen genom lokal oskärpa. Ändringar över tröskelvärdet räknas som kanter och görs istället skarpare.";"CIOpTile" = "Delar upp en bild och utför angivna skalningar och roteringar och sätter sedan samman bilden igen. Detta ger bilden en känsla av opkonst.";"CIPageCurlTransition" = "Övergång från en bild till en annan genom att simulera en sida som viks upp och visar bilden på sidan under.";"CIParallelogramTile" = "Förvränger en bild genom att spegla den i ett parallelogram och lägger sedan resultatet i ett rutmönster.";"CIPerspectiveTile" = "Tillämpar en perspektivtransformering på en bild och lägger den sedan i ett rutmönster.";"CIPerspectiveTransform" = "Ändrar geometrin i en bild för att simulera att betraktaren flyttar sig. Perspektivfiltret kan användas för att förvränga en bild.";"CIPinchDistortion" = "Skapar ett rektangulärt område som kniper ihop bildens bildpunkter. Pixlarna närmast rektangelns mitt förvrängs mest.";"CIPixellate" = "Bygger bilden med blockbildpunkter.";"CIPointillize" = "Bygger upp bilden med punkter.";"CIRadialGradient" = "Skapar en övergång som varierar radialt mellan två cirklar som har samma mittpunkt. Den ena cirkeln kan ha radien 0.";"CIRandomGenerator" = "Skapar en oändlig bild vars bildpunktsvärden består av fyra oberoende, jämt spridda slumptal från 0 till 1.";"CIRippleTransition" = "En bild övergår i en annan genom att skapa en cirkelformad våg som växer utåt från mitten och visar den nya bilden i vågornas efterdyningar.";"CISepiaTone" = "Kopplar bildens färger till olika nyanser av brunt.";"CIShadedMaterial" = "Skapar en skuggad bild utifrån ett höjdfält. Höjdfältet visar högre höjder i ljusa toner och lägre höjder i mörkare toner. Kombinera detta med filtret CIHeightFieldFromMask för att snabbt kunna skugga masker såsom text.";"CISharpenLuminance" = "Gör bilden mer detaljerad genom att göra den skarpare. Det påverkar bildens ljusstyrka medan bildpunkternas krominans är oförändrade.";"CISixfoldReflectedTile" = "Skapar en rutmönster från en källbild genom sexfaldigt reflekterad symmetri.";"CISixfoldRotatedTile" = "Framställer en rutmönstrad bild från källbilden genom att rotera källan i steg om 60 grader.";"CISourceAtopCompositing" = "Lägger källbilden ovanpå bakgrundsbilden och använder sedan bakgrundsbildens ljusstyrka för att ange vad som ska visas. Sammansättningen visar bakgrundsbilden och endast de delar av källbilden som ligger över bakgrundens synliga delar.";"CISourceInCompositing" = "Använder en andra bild för att bestämma vad som ska synas i källbilden. Detta beskär bilden.";"CISourceOutCompositing" = "Använder en andra bild för att bestämma vad som ska tas bort från den första bilden.";"CISourceOverCompositing" = "Placerar en andra bild över den första.";"CISpotColor" = "Ersätter en eller flera färgspektra med punktfärger.";"CISpotLight" = "Lägger en riktad spotlighteffekt på en bild.";"CIStarShineGenerator" = "Skapar ett stjärnmönster. Målbilden används oftast som indata i ett annat filter.";"CIStripesGenerator" = "Skapar ett randigt mönster. Det går att justera rändernas färg, avstånd och kontrast.";"CISunbeamsGenerator" = "Skapar en soleffekt. Normalt används solstrålefiltret som indata till ett sammansatt filter.";"CISwipeTransition" = "Övergår från en bild till en annan genom att simulera en svepande rörelse.";"CITorusLensDistortion" = "Skapar en torusformad lins och förvränger bilden där linsen placeras.";"CITriangleTile" = "Kopplar en triangulär del av bilden till ett triangulärt område och lägger sedan resultatet sida vid sida.";"CITwelvefoldReflectedTile" = "Skapar en rutmönster från en källbild genom tolvfaldigt reflekterad symmetri.";"CITwirlDistortion" = "Roterar bildpunkter runt en punkt för att skapa en virveleffekt. Det går att bestämma antalet rotationer, och effektens mittpunkt och radie.";"CIUnsharpMask" = "Ökar kontrasten på kanterna mellan bildpunkter av olika färg i en bild.";"CIVortexDistortion" = "Roterar bildpunkter runt en punkt för att skapa en vortexeffekt. Det går att bestämma antalet rotationer, och effektens mittpunkt och radie. ";"CIWhitePointAdjust" = "Justerar vitpunktsreferensen för en bild och kopplar alla färger i källen till den nya referensen.";"CIZoomBlur" = "Simulerar effekten som uppnås genom att zooma in kameran medan bilden tas.";"CIColorBlendMode" = "Avänder bakgrundens ljusstyrkevärden tillsammans med källbildens nyans- och mättnadsvärden. Detta läge bevarar gråskalorna i bilden.";"CIColorBurnBlendMode" = "Mörkar ner bakgrundsbildens samplingar så att de reflekterar källbildens samplingar. Källbildsvärden som är vita ändras inte.";"CIColorDodgeBlendMode" = "Gör bakgrundsbildens samplingar ljusare så att de reflekterar källbildens samplingar. Källbildsvärden som är svarta ändras inte.";"CIDarkenBlendMode" = "Skapar sammansatta bildsamplingar genom att välja de mörkare samplingarna (från källbilden eller från bakgrunden). Resultatet blir att bakgrundssamplingarna byts ut mot de källbildssamplingar som är mörkare. I övrigt lämnas bakgrundssamplingarna orörda.";"CIDifferenceBlendMode" = "Subtraherar källbildens färgsamplingar från bakgrundsbildens färgsamplingar eller tvärtom beroende på vilken sampling som har starkast ljusvärden. Svarta värden för källbildssamplingar förändrar inget. Vita inverterar bakgrundsfärgens värden.";"CIExclusionBlendMode" = "Skapar en effekt som liknar filtret CIDifferenceBlendMode men med lägre kontrast. Svarta värden i källbildssamplingen medför ingen ändring. Vita värden inverterar bakgrundsfärgens värden.";"CIHardLightBlendMode" = "Mångdubblar eller tunnar ut färger beroende på källbildens samplingsfärg. Om källbildens samplingsfärg är ljusare än 50 % grå görs bakgrunden ljusare som om den hade tunnats ut. Om källbildens samplingsfärg är mörkare än 50 % grå görs bakgrunden mörkare genom mångdubbling. Om källbildens samplingsfärg är lika med 50 % grå ändras inte bilden. Bildsamplingar som är lika med helt svart eller vitt resulterar i helt svart eller vitt. Effekten liknar den man får då man lyser en stark lampa på källbilden.";"CIHueBlendMode" = "Använder bakgrundens ljus- och mättnadsvärden tillsammans med källbildens nyans.";"CILightenBlendMode" = "Skapar sammansatta bildsamplingar genom att välja de ljusare samplingarna (antingen från källbilden eller från bakgrunden). Resultatet blir att bakgrundssamplingarna byts ut mot de källbildssamplingar som är ljusare. I övrigt lämnas bildsamplingarna orörda.";"CILuminosityBlendMode" = "Avänder bakgrundens ton och mättnad tillsammans med källbildens ljusstyrka. Detta skapar en motsatt effekt till CIColorBlendMode.";"CIMultiplyBlendMode" = "Multiplicerar källbildssamplingarna med bakgrundssamplingarna. Färgerna blir som allra minst lika mörka som någon av de två samplingsfärgerna.";"CIOverlayBlendMode" = "Multiplicerar eller delar källbildssamplingarna med bakgrundssamplingarna beroende på bakgrundsfärgen. Resultatet blir att källbildensamplingarna ligger över bakgrunden, medan bakgrundens skuggor och högdagrar finns kvar. Bakgrundsfärgen blandas med källbildens färger och reflekterar bakgrundens ljus och mörker.";"CISaturationBlendMode" = "Använder bakgrundens ljus- och nyansvärden tillsammans med källbildens mättnad. Områden i bakgrunden som saknar mättnad (helt gråa områden) ändras inte.";"CIScreenBlendMode" = "Multiplicerar inverterade källbildssamplingar med inverterade bakgrundssamplingar. Färgerna blir minst lika ljusa som någon av de två samplingsfärgerna.";"CISoftLightBlendMode" = "Gör färger mörkare eller ljusare beroende på källbildens samplingsfärg. Om källbildens samplingsfärg är ljusare än 50 % grå görs bakgrunden ljusare som med pjattning. Om källbildens samplingsfärg är mörkare än 50 % grå görs bakgrunden mörkare som med efterexponering. Om källbildens samplingsfärg är lika med 50 % grå ändras inte bilden. Bildsamplingar som är lika med helt svart eller vitt resulterar i mörkare eller ljusare partier. Reslutatet blir dock inte helt svart eller vitt. Effekten liknar den man får då man lyser en svag lampa på källbilden.";"outputImage" = "Bilden som skapas med hjälp av ett filter.";"inputBackgroundImage" = "Bilden som används som bakgrundsbild.";"inputImage" = "Bilden som används som indatabild. För filter som även använder en bakgrundsbild är detta förgrundsbilden.";"inputTime" = "Effektens varaktighet.";"inputTransform" = "En transformering som ska användas.";"inputScale" = "Effektens mängd.";"inputAspectRatio" = "En proportion.";"inputCenter" = "Mitten av området som ska filtreras, angett med koordinaterna x och y.";"inputRadius" = "Avståndet från effektens mittpunkt.";"inputAngle" = "En vinkel.";"inputRefraction" = "Brytningsvinkelns index på det material (till exempel glas) som används i effekten.";"inputWidth" = "Effektens bredd.";"inputSharpness" = "Hur mycket skärpa som läggs till.";"inputIntensity" = "Effektens intensitet.";"inputEV" = "Hur många bländarsteg ljusare eller mörkare bilden ska bli.";"inputSaturation" = "Hur mycket mättnaden justeras.";"inputColor" = "En färg.";"inputBrightness" = "En ljusstyrkenivå.";"inputContrast" = "En kontrastnivå.";"inputGradientImage" = "En miljökarta med alfa. Oftast är detta en bild med högdagrar och skuggor.";"inputMaskImage" = "En maskeringsbild.";"inputShadingImage" = "En miljökarta med alfavärden. Oftast är detta en bild med högdagrar och skuggor.";"inputTargetImage" = "Målbilden i en övergång.";"inputExtent" = "En rektangel som anger effektens utsträckning.";"CIBoxBlur.inputRadius" = "Radien bestämmer hur många bildpunkter som används för oskärpan. Ju större radie desto mer oskärpa.";"CIDiscBlur.inputRadius" = "Radien bestämmer hur många bildpunkter som används för oskärpan. Ju större radie desto mer oskärpa.";"CIGaussianBlur.inputRadius" = "Radien bestämmer hur många bildpunkter som används för oskärpan. Ju större radie desto mer oskärpa.";"CIMotionBlur.inputRadius" ="Radien bestämmer hur många bildpunkter som används för oskärpan. Ju större radie desto mer oskärpa.";"CIMotionBlur.inputAngle" = "Rörelsen vinkel bestämmer i vilken riktning oskärpan smetas ut.";"CINoiseReduction.inputNoiseLevel" = "Mängden brusreducering. Ju högre värde desto mer brusreducering.";"CINoiseReduction.inputSharpness" = "Resultatbildens skärpa. Ju högre värde desto skarpare bild.";"CIZoomBlur.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";"CIZoomBlur.inputAmount" = "Hur mycket bilden zoomas in. Högre värden ger mer inzoomning.";"CIColorControls.inputSaturation" = "Hur mättad bilden blir. Ju högre värde desto större mättnad.";"CIColorControls.inputBrightness" = "Hur ljus bilden blir. Ju högre värde desto ljusare resultat.";"CIColorControls.inputContrast" = "Hur stor kontrast bilden får. Ju högre värde desto större kontrast i målbilden.";"CIColorMatrix.inputRVector" = "Mängden rött som källfärgsvärdena multipliceras med.";"CIColorMatrix.inputGVector" = "Mängden grönt som källfärgsvärdena multipliceras med.";"CIColorMatrix.inputBVector" = "Mängden blått som källfärgsvärdena multipliceras med.";"CIColorMatrix.inputAVector" = "Mängden alfa som källfärgsvärdena multipliceras med.";"CIColorMatrix.inputBiasVector" = "En vektor som läggs till varje färgkomponent.";"CIExposureAdjust.inputEV" = "Hur stor justeringen av bildens exponering blir. Ju högre värde desto ljusare blir exponeringen.";"CIGammaAdjust.inputPower" = "Ett gammavärde som korrigerar bildens ljusstyrka. Ju högre värde desto mörkare resultat.";"CIHueAdjust.inputAngle" = "Vinkeln (i grader) för korrigering av bildens nyans.";"CIWhitePointAdjust.inputColor" = "En färg att använda som vitpunkt.";"CIColorCube.inputDimension" = "Färgtabellens mått.";"CIColorCube.inputCubeData" = "Detta är en färgtabell med RGBA-flyttalsceller som använder förmångfaldigad alfa. Cellerna är i standardordning. Kolumnerna och raderna indexeras efter rött respektive grönt. Varje dataplan följs av nästa högre plan. Planen indexeras efter blått.";"CIColorMap.inputGradientImage" = "Bildens bilddata transformeras till källbildsvärdena.";"CIColorMonochrome.inputColor" = "Den svartvita färgen som läggs till bilden.";"CIColorMonochrome.inputIntensity" = "Den svartvita effektens intensitet. Värdet 1,0 skapar en svartvit bild med hjälp av den givna färgen. Värdet 0,0 har ingen effekt på bilden.";"CIColorPosterize.inputLevels" = "Antalet ljusstyrkenivåer som används för varje färgkomponent. Lägre värden ger mer färgreduktion.";"CIFalseColor.inputColor0" = "Den första färgen i färgrampen.";"CIFalseColor.inputColor1" = "Den andra färgen i färgrampen.";"CISepiaTone.inputIntensity" = "Sepiatonens intensitet. Värdet 1,0 skapar en sepiatonad bild med hjälp av den givna färgen. Värdet 0,0 har ingen effekt på bilden.";"CIBumpDistortion.inputCenter" = "Positionerna x och y som anger utbuktningens mittpunkt."; "CIBumpDistortion.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning."; "CIBumpDistortion.inputScale" = "Effektens skala bestämmer utbuktningens kurva. Värdet 0,0 har ingen effekt. Positiva värden skapar en utbuktning och negativa värden en inbuktning."; "CIBumpDistortionLinear.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt."; "CIBumpDistortionLinear.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning.";  "CIBumpDistortionLinear.inputScale" = "Effektens skala."; "CIBumpDistortionLinear.inputAngle" = "Vinkeln (i grader) på linjen som förvrängningen sker runt."; "CICircleSplashDistortion.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt.";  "CICircleSplashDistortion.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning.";  "CICircularWrap.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt.";  "CICircularWrap.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning.";  "CICircularWrap.inputAngle" = "Effektens vinkel."; "CIDisplacementDistortion.inputDisplacementImage" = "En bild vars gråskalevärden används för källbilden."; "CIDisplacementDistortion.inputScale" = "Hur mycket textur som ska användas. Ju högre värde desto mer textur."; "CIGlassDistortion.inputTexture" = "En textur som används för källbilden.";"CIGlassDistortion.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt."; "CIGlassDistortion.inputScale" = "Hur mycket textur som ska användas. Ju högre värde desto mer textur."; "CIGlassLozenge.inputPoint0" = "Positionerna x och y som bestämmer mittpunkten på cirkeln i ena änden av tablettformen."; "CIGlassLozenge.inputPoint1" = "Positionerna x och y som bestämmer mittpunkten på cirkeln i andra änden av tablettformen.";  "CIGlassLozenge.inputRadius" = "Tablettformens radie. Ju större radie desto större förvrängning.";  "CIGlassLozenge.inputRefraction" = "Glasets brytningsvinkel."; "CIHoleDistortion.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt.";  "CIHoleDistortion.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning.";  "CIPinchDistortion.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt."; "CIPinchDistortion.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning."; "CIPinchDistortion.inputScale" = "Hur stor knipeffekten blir. Värdet 0,0 har ingen effekt. Värdet 1,0 är den maximala knipeffekten.";"CITorusLensDistortion.inputCenter" = "Positionerna x och y som anger torusens mittpunkt.";  "CITorusLensDistortion.inputRadius" = "Torusens yttre radie.";  "CITorusLensDistortion.inputWidth" = "Ringens bredd."; "CITorusLensDistortion.inputRefraction" = "Glasets brytningsvinkel."; "CITwirlDistortion.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt.";  "CITwirlDistortion.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning."; "CITwirlDistortion.inputAngle" = "Virvelns vinkel (i grader). Värdena kan vara positiva eller negativa.";"CIVortexDistortion.inputCenter" = "Positionerna x och y som anger förvrängningens mittpunkt."; "CIVortexDistortion.inputRadius" = "Radien bestämmer hur många bildpunkter som används för förvrängningen. Ju större radie desto mer förvrängning."; "CIVortexDistortion.inputAngle" = "Vortexens vinkel (i grader).";"CICheckerboardGenerator.inputColor0" = "En färg för den första uppsättningen shackrutor.";"CICheckerboardGenerator.inputColor1" = "En färg för den andra uppsättningen schackrutor.";"CICheckerboardGenerator.inputWidth" = "Bredden på en ruta i schackmönstret.";"CICheckerboardGenerator.inputSharpness" = "Skärpan på schackmönstret. Ju lägre värde desto mer oskarpt mönster. Giltiga värden: från 0,0 till 1,0.";"CIConstantColorGenerator.inputColor" = "Färgen som ska framställas."; "CILenticularHaloGenerator.inputCenter" = "Positionerna x och y som anger nimbusens mittpunkt.";"CILenticularHaloGenerator.inputHaloRadius" = "Nimbusens radie.";"CILenticularHaloGenerator.inputHaloWidth" = "Nimbusens bredd från den inre till den yttre radien.";"CILenticularHaloGenerator.inputOverlap" = "Hur stor överlappning det är mellan diffraktionskomponenterna i nimbusen. Värdet 1,0 innebär total överlappning - nimbusen är vit. Värdet 0,0 är ingen överöverlappning alls.";"CILenticularHaloGenerator.inputStriationStrength" = "Nimbusfärgernas intensitet. Högre värden ger intensivare färg.";"CILenticularHaloGenerator.inputStriationContrast" = "Nimbusfärgernas kontrast. Högre värden ger större kontrast.";"CIStarShineGenerator.inputCenter" = "Positionerna x och y som anger stjärnans mittpunkt."; "CIStarShineGenerator.inputColor" = "Färgen som används till den runda stjärnans yttre skal."; "CIStarShineGenerator.inputRadius" = "Stjärnans radie."; "CIStarShineGenerator.inputCrossScale" = "Kryssmönstrets storlek."; "CIStarShineGenerator.inputCrossAngle" = "Kryssmönstrets vinkel."; "CIStarShineGenerator.inputCrossOpacity" = "Kryssmönstrets opacitet."; "CIStarShineGenerator.inputCrossWidth" = "Kryssmönstrets bredd."; "CIStarShineGenerator.inputEpsilon" = "Krysspiggarnas längd."; "CIStripesGenerator.inputCenter" = "Positionerna x och y som anger randmönstrets mittpunkt."; "CIStripesGenerator.inputColor0" = "Färgen som används för de udda ränderna."; "CIStripesGenerator.inputColor1" = "Färgen som används för de jämna ränderna.";"CIStripesGenerator.inputWidth" = "En rands bredd."; "CIStripesGenerator.inputSharpness" = "Skärpan på randrutemönstret. Ju lägre värde dest mer oskarpt mönster. Värden varierar mellan 0,0 till 1,0."; "CISunbeamsGenerator.inputCenter" = "Positionerna x och y som anger solstrålemönstrets mittpunkt.";"CISunbeamsGenerator.inputColor" = "Solens färg.";"CISunbeamsGenerator.inputSunRadius" = "Solens radie.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Solstrålarnas radie.";"CISunbeamsGenerator.inputStriationStrength" = "Solstrålarnas intensitet. Höga värden ger högre intensitet.";"CISunbeamsGenerator.inputStriationContrast" = "Solstrålarnas kontrast. Höga värden ger mer kontrast.";"CIAffineTransform.inputTransform" = "En transformering som ska användas för bilden."; "CICrop.inputRectangle" = "Rektangeln som bestämmer bildens beskärning."; "CILanczosScaleTransform.inputScale" = "Bildens förstoringsgrad. Lägre värden än 1,0 förminskar bilden. Högre värden än 1,0 förstorar bilden."; "CILanczosScaleTransform.inputAspectRatio" = "Bildens proportioner."; "CIPerspectiveTransform.inputTopLeft" = "Den övre vänstra koordinaten som bilden knyts till."; "CIPerspectiveTransform.inputTopRight" = "Den övre högra koordinaten som bilden knyts till."; "CIPerspectiveTransform.inputBottomRight" = "Den nedre högra koordinaten som bilden knyts till."; "CIPerspectiveTransform.inputBottomLeft" = "Den nedre vänstra koordinaten som bilden knyts till."; "CIGaussianGradient.inputColor0" = "Den första färgen som används i övertoningen."; "CIGaussianGradient.inputColor1" = "Den andra färgen som används i övertoningen."; "CIGaussianGradient.inputRadius" = "Den gaussiska fördelningens radie."; "CILinearGradient.inputPoint0" = "Övertoningens startpunkt -- den första färgens början."; "CILinearGradient.inputPoint1" = "Övertoningens slut -- den andra färgens början."; "CILinearGradient.inputColor0" = "Den första färgen som används i övertoningen.";  "CILinearGradient.inputColor1" = "Den andra färgen som används i övertoningen.";  "CIRadialGradient.inputRadius0" = "Radien på den första cirkeln i övergången.";"CIRadialGradient.inputRadius1" = "Radien på den sista cirkeln i övergången.";"CIRadialGradient.inputColor0" = "Den första färgen som används i övertoningen.";  "CIRadialGradient.inputColor1" = "Den andra färgen som används i övertoningen."; "CICircularScreen.inputCenter" = "Positionerna x och y som anger det runda rastermönstrets mittpunkt."; "CICircularScreen.inputWidth" = "Avståndet mellan varje cirkel i mönstret."; "CICircularScreen.inputSharpness" = "Cirklarnas skärpa. Ju högre värde desto skarpare cirklar."; "CICMYKHalftone.inputCenter" = "Positionerna x och y som anger halvtonsmönstrets mittpunkt.";  "CICMYKHalftone.inputWidth" = "Avståndet mellan punkter i mönstret."; "CICMYKHalftone.inputAngle" = "Mönstrets vinkel."; "CICMYKHalftone.inputSharpness" = "Mönstrets skärpa. Ju högre värde desto skarpare mönster."; "CICMYKHalftone.inputGCR" = "Gråkomponentens ersättningsvärde. Värdet kan variera från 0,0 (inget) till 1,0."; "CICMYKHalftone.inputUCR" = "Värdet av nederfärgsborttagning. Värdet kan variera från 0,0 till 1,0. "; "CIDotScreen.inputCenter" = "Positionerna x och y som anger punktrastermönstrets mittpunkt.";  "CIDotScreen.inputAngle" = "Mönstrets vinkel."; "CIDotScreen.inputWidth" = "Avståndet mellan punkter i mönstret."; "CIDotScreen.inputSharpness" = "Mönstrets skärpa. Ju högre värde desto skarpare mönster."; "CIHatchedScreen.inputCenter" = "Positionerna x och y som anger det skrafferade rastermönstrets mittpunkt."; "CIHatchedScreen.inputAngle" = "Mönstrets vinkel.";"CIHatchedScreen.inputWidth" = "Avståndet mellan linjer i mönstret."; "CIHatchedScreen.inputShaprness" = "Mönstrets skärpa. Ju högre värde desto skarpare mönster."; "CILineScreen.inputCenter" = "Positionerna x och y som anger linjerastermönstrets mittpunkt.";  "CILineScreen.inputAngle" = "Mönstrets vinkel."; "CILineScreen.inputWidth" = "Avståndet mellan linjer i mönstret."; "CILineScreen.inputSharpness" = "Mönstrets skärpa. Ju högre värde desto skarpare mönster."; 	"CISharpenLuminance.inputSharpness" = "Hur skarp bilden blir. Ju högre värden desto skarpare resultat.";"CIUnsharpMask.inputRadius" = "Radien kring en viss bildpunkt som omfattas av oskärpemasken.";"CIUnsharpMask.inputIntensity" = "Effektens intensitet. Ju högre värde desto starkare kontrast i området.";"CIBlendWithMask.inputMaskImage" = "En gråskalemask. Då maskvärdet är 0,0 är bakgrunden resultatet. Då maskvärdet är 1,0 är bilden resultatet."; "CIBloom.inputRadius" = "Radien bestämmer hur många bildpunkter som används till effekten. Ju större radie desto större effekt.";"CIBloom.inputIntensity" = "Effektens intensitet. Värdet 0,0 är ingen effekt. Värdet 1,0 är maximal effekt."; "CICrystallize.inputRadius" = "Radien bestämmer hur många bildpunkter som används för effekten. Ju större radie desto större är blir kristallerna."; "CIEdges.inputIntensity" = "Kanternas intensitet. Ju högre värde desto mer intensitet."; "CIEdgeWork.inputRadius" = "Kanternas tjocklek. Ju högre värde desto tjockare kanter."; "CIGloom.inputRadius" = "Radien bestämmer hur många bildpunkter som används till effekten. Ju större radie desto större effekt."; "CIGloom.inputIntensity" = "Effektens intensitet. Värdet 0,0 är ingen effekt. Värdet 1,0 är maximal effekt."; "CIHeightFieldFromMask.inputImage" = "De vita värdena i masken bestämmer bildpunkterna inuti höjdfältet och de svarta värdena bestämmer bildpunkterna utanför. Fältet varierar mjukt och kontinuerligt i masken och når värdet 0 vid maskens kant."; "CIHeightFieldFromMask.inputRadius" = "Avståndet från maskens kant för den mjuka övergången beror på indataradien. Högre värden gör övergången mjukare och tydligare. Lägre värden gör att övergångarna närmar sig kantradien."; "CIHexagonalPixellate.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CIHexagonalPixellate.inputScale" = "Skalan bestämmer sexhörningarnas storlek. Större värden ger större sexhörningar."; "CILineOverlay.inputNRNoiseLevel" = "Brusnivån på bilden (utifrån kameradata) som tas bort innan bildens kanter ritas upp. En högre brusnivå gör det lättare att snygga till bildens kanter."; "CILineOverlay.inputNRSharpness" = "Hur mycket bilden skärps när brus tas bort innan bildens kanter ritas upp. Det gör det lättare att hitta kanten."; "CILineOverlay.inputEdgeIntensity" = "Hur framhävd Sobelns lutningsgrad är när den följer bildens kanter. Högre värden hittar fler kanter. Normalt sätt används ett lågt värde (till exempel 1,0)."; "CILineOverlay.inputThreshold" = "Detta värde bestämmer kantens synlighet. Ju högre värden desto finare kanter."; "CILineOverlay.inputContrast" = "Graden av kantutjämning som filtret ger. Högre värden ger skarpare kontrast på kanterna (de är mindre utjämnade)."; "CIPixellate.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIPixellate.inputScale" = "Skalan bestämmer fyrkanternas storlek. Högre värden ger större fyrkanter."; "CIPointillize.inputRadius" = "Radien på cirklarna i det slutliga mönstret."; "CIPointillize.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIShadedMaterial.inputShadingImage" = "Bilden som används som höjdfält. Slutbilden har högre höjder i ljusare toner och lägre höjder (lägre områden) i mörkare toner."; "CIShadedMaterial.inputScale" = "Effektens skala. Ju högre värde desto starkare effekt."; "CISpotColor.inputCenterColor1" = "Mittvärdet för den första färgen som ersätts."; "CISpotColor.inputReplacementColor1" = "En ersättningsfärg för den första färgrymden."; "CISpotColor.inputCloseness1" = "Ett värde som anger hur nära den första färgen måste matchas innan den ersätts."; "CISpotColor.inputContrast1" = "Den första ersättningsfärgens kontrast."; "CISpotColor.inputCenterColor2" = "Mittvärdet för den andra färgen som ersätts."; "CISpotColor.inputReplacementColor2" = "En ersättningsfärg för den andra färgrymden.";"CISpotColor.inputCloseness2" = "Ett värde som anger hur nära den andra färgen måste matchas innan den ersätts."; "CISpotColor.inputContrast2" = "Den andra ersättningsfärgens kontrast."; "CISpotColor.inputCenterColor3" = "Mittvärdet för den tredje färgen som ersätts.";  "CISpotColor.inputReplacementColor3" = "En ersättningsfärg för den tredje färgrymden."; "CISpotColor.inputCloseness3" = "Ett värde som anger hur nära den tredje färgen måste matchas innan den ersätts.";  "CISpotColor.inputContrast3" = "Den tredje ersättningsfärgens kontrast.";  "CISpotLight.inputLightPosition" = "Spotlightens x- och y-positioner."; 		"CISpotLight.inputLightPointsAt" = "Positionerna x och y som spotlighten pekar på.";  "CISpotLight.inputBrightness" = "Spotlightens ljusstyrka."; "CISpotLight.inputConcentration" = "Spotlightens storlek. Ju lägre värde desto mindre och mer fokuserad blir ljusstrålen."; "CISpotLight.inputColor" = "Spotlightens färg."; "CIAffineClamp.inputTransform" = "Transformeringen som ska användas för bilden."; "CIAffineTile.inputTransform" = "Transformeringen som ska användas för bilden."; "CIEightfoldReflectedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIEightfoldReflectedTile.inputAngle" = "Rutmönstrets vinkel (i grader)."; "CIEightfoldReflectedTile.inputWidth" = "En rutas bredd."; "CIFourfoldReflectedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIFourfoldReflectedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CIFourfoldReflectedTile.inputAcuteAngle" = "Ursprungsvinkeln för ett upprepat reflekterat rutmönster. Låga värden ger smala, avlånga rutor. Höga värden ger bredare reflekterade rutor."; "CIFourfoldReflectedTile.inputWidth" = "En rutas bredd.";  "CIFourfoldRotatedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIFourfoldRotatedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CIFourfoldRotatedTile.inputWidth" = "En rutas bredd."; "CIFourfoldTranslatedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIFourfoldTranslatedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "Ursprungsvinkeln för ett upprepat omvandlat rutmönster. Låga värden ger smala, avlånga rutor. Höga värden ger bredare omvandlade rutor."; "CIFourfoldTranslatedTile.inputWidth" = "En rutas bredd.";  "CIGlideReflectedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIGlideReflectedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CIGlideReflectedTile.inputWidth" = "En rutas bredd.";  "CIKaleidoscope.inputCount" = "Antal reflexioner i mönstret."; "CIKaleidoscope.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIKaleidoscope.inputAngle" = "Reflexionsvinkel."; "CIOpTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CIOpTile.inputScale" = "Skalan bestämmer antalet rutor i effekten."; "CIOpTile.inputAngle" = "En rutas vinkel."; "CIOpTile.inputWidth" = "En rutas bredd."; "CIParallelogramTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CIParallelogramTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CIParallelogramTile.inputAcuteAngle" = "Ursprungsvinkeln för ett upprepat omvandlat parallelogrammönster. Låga värden ger smala, avlånga rutor. Höga värden ger bredare parallelogramrutor."; "CIParallelogramTile.inputWidth" = "En rutas bredd.";  "CIPerspectiveTile.inputTopLeft" = "En rutas övre vänstra hörns koordinater."; "CIPerspectiveTile.inputTopRight" = "En rutas övre högra hörns koordinater.";"CIPerspectiveTile.inputBottomRight" = "En rutas nedre högra hörns koordinater."; "CIPerspectiveTile.inputBottomLeft" = "En rutas nedre vänstra hörns koordinater."; "CISixfoldReflectedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CISixfoldReflectedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CISixfoldReflectedTile.inputWidth" = "En rutas bredd."; "CISixfoldRotatedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CISixfoldRotatedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CISixfoldRotatedTile.inputWidth" = "En rutas bredd.";  "CITriangleTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt.";  "CITriangleTile.inputAngle" = "Rutmönstrets vinkel (i grader).";  "CITriangleTile.inputWidth" = "En rutas bredd.";  "CITwelvefoldReflectedTile.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CITwelvefoldReflectedTile.inputAngle" = "Rutmönstrets vinkel (i grader).";"CITwelvefoldReflectedTile.inputWidth" = "En rutas bredd."; "CIBarsSwipeTransition.inputAngle" = "Radernas vinkel (i grader).";	"CIBarsSwipeTransition.inputWidth" = "Varje rads bredd.";	"CIBarsSwipeTransition.inputBarOffset" = "Hur långt en rad förskjutits från en annan";	"CIBarsSwipeTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CICopyMachineTransition.inputColor" = "Kopieringsljusets färg.";"CICopyMachineTransition.inputAngle" = "Kopieringsljusets vinkel.";"CICopyMachineTransition.inputWidth" = "Kopieringsljusets bredd. ";"CICopyMachineTransition.inputOpacity" = "Kopieringsljusets opacitet. Värdet 0,0 är genomskinligt. Värdet 1,0 är helt ogenomskinligt.";"CICopyMachineTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "En bild som anger vilken form som används för att lösa upp källbilden till målbilden.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Radien av skuggan som skapas av masken.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "Tätheten i skuggan som skapas av masken.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Förskjutningen i skuggan som skapas av masken.";"CIDisintegrateWithMaskTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIDissolveTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIFlashTransition.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CIFlashTransition.inputExtent" = "Blixtens utbredning.";"CIFlashTransition.inputColor" = "Färgen på de ljusstrålar som utgår från en blixt.";"CIFlashTransition.inputMaxStriationRadius" = "Radien på de ljusstrålar som utgår från en blixt.";"CIFlashTransition.inputStriationStrength" = "Längden på de ljusstrålar som utgår från en blixt.";"CIFlashTransition.inputStriationContrast" = "Kontrasten på de ljusstrålar som utgår från en blixt.";"CIFlashTransition.inputFadeThreshold" = "Tiden det tar för blixten att tona över i målbilden. Ju högre värde desto längre varar blixten och desto kortare blir övertoningen.";"CIFlashTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIModTransition.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CIModTransition.inputAngle" = "Mod-hålmönsters vinkel.";"CIModTransition.inputRadius" = "Radien på de hål i mönstret som inte är förvrängda.";"CIModTransition.inputCompression" = "Hur uttänjt mod-hålmönstret blir. Hål i mitten blir mindre förvrängda än de i kanterna.";"CIModTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIPageCurlTransition.inputBacksideImage" = "Bilden som syns på baksidan av källbilden när sidan viks undan för att visa målbilden.";"CIPageCurlTransition.inputShadingImage" = "En bild som liknar en skuggad sfär i en fyrkantig bild.";"CIPageCurlTransition.inputExtent" = "Effektens omfång.";"CIPageCurlTransition.inputAngle" = "Den upprullade kantens vinkel.";"CIPageCurlTransition.inputRadius" = "Det upprullade papprets radie.";"CIPageCurlTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIRippleTransition.inputShadingImage" = "En bild som liknar en skuggad sfär i en fyrkantig bild.";"CIRippleTransition.inputCenter" = "Positionerna x och y som anger effektens mittpunkt."; "CIRippleTransition.inputExent" = "Effektens omfång.";"CIRippleTransition.inputWidth" = "Krusningens bredd.";"CIRippleTransition.inputScale" = "Ett värde som bestämmer om krusningen ska börja som en bula (höga värden) eller grop (låga värden).";"CIRippleTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CISwipeTransition.inputExtent" = "Effektens omfång.";"CISwipeTransition.inputColor" = "Svepets färg.";"CISwipeTransition.inputAngle" = "Svepets vinkel.";"CISwipeTransition.inputWidth" = "Svepets bredd.";"CISwipeTransition.inputOpacity" = "Svepets opacitet.";"CISwipeTransition.inputTime" = "Övergångens parametertid. Värdet styr övergången från början (vid tid 0) till slut (vid tid 1).";"CIAreaHistogram" = "Beräknar ett histogram för det angivna området i en bild och ger resultatet i en 1D-bild.";"CIAreaHistogram.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIAreaHistogram.inputCount" = "Antalet bins för histogrammet.";"CIAreaHistogram.inputImage" = "Bilden vars histogram du vill beräkna.";"CIAreaHistogram.inputScale" = "Skalvärdet som ska användas för histogramvärdena.";"CIAreaMaximum" = "Beräknar de maximala komponentvärdena för det angivna området i en bild och ger resultatet i en bildpunkt.";"CIAreaMaximum.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIAreaMaximum.inputImage" = "Bilden som ska bearbetas.";"CIAreaMinimum" = "Beräknar de minimala komponentvärdena för det angivna området i en bild och ger resultatet i en bildpunkt.";"CIAreaMinimum.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIAreaMinimum.inputImage" = "Bilden som ska bearbetas.";"CIAreaMaximumAlpha" = "Hittar och returnerar bildpunkten med maximalt alfavärde.";"CIAreaMaximumAlpha.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIAreaMaximumAlpha.inputImage" = "Bilden som ska bearbetas.";"CIAreaMinimumAlpha" = "Hittar och returnerar bildpunkten med minsta alfavärde.";"CIAreaMinimumAlpha.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIAreaMinimumAlpha.inputImage" = "Bilden som ska bearbetas.";"CIAreaAverage" = "Beräknar genomsnittsfärgen för det angivna området i en bild och ger resultatet i en bildpunkt.";"CIAreaAverage.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIAreaAverage.inputImage" = "Bilden som ska bearbetas.";"CIRowAverage" = "Beräknar genomsnittsfärgen för varje rad i det angivna området i en bild och returnerar resultatet i en 1D-bild.";"CIRowAverage.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIRowAverage.inputImage" = "Bilden som ska bearbetas.";"CIColumnAverage" = "Beräknar genomsnittsfärgen för varje kolumn i det angivna området i en bild och returnerar resultatet i en 1D-bild.";"CIColumnAverage.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIColumnAverage.inputImage" = "Bilden som ska bearbetas.";"CIMinimumComponent" = "Konverterar en bild till gråskala med minstavärdena i de tre färgkomponenterna.";"CIMinimumComponent.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIMinimumComponent.inputImage" = "Bilden som ska bearbetas.";"CIMaximumComponent" = "Konverterar en bild till gråskala med maxvärdena i de tre färgkomponenterna.";"CIMaximumComponent.inputExtent" = "En rektangel som anger underregionen av den bild du vill bearbeta.";"CIMaximumComponent.inputImage" = "Bilden som ska bearbetas.";